# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Files\Uni\Embedded_4\Emb4\Schak_RTC_Test.cydsn\Schak_RTC_Test.cyprj
# Date: Wed, 16 Oct 2024 15:34:06 GMT
#set_units -time ns
create_clock -name {mSec_clock_1(routed)} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {mSec_clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 33} [list [get_pins {ClockBlock/dclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Files\Uni\Embedded_4\Emb4\Schak_RTC_Test.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Files\Uni\Embedded_4\Emb4\Schak_RTC_Test.cydsn\Schak_RTC_Test.cyprj
# Date: Wed, 16 Oct 2024 15:33:59 GMT
